# リンク予測(drug_bank)
## ECFP -> ニューラルネットワーク

In [1]:
import pandas as pd
import numpy as np

In [2]:
# import xml.etree.ElementTree as ET
# tree = ET.parse('full_database.xml')

In [3]:
import csv

In [2]:
from rdkit import Chem
from rdkit.Chem import AllChem, Draw, PandasTools

In [5]:
# root = tree.getroot()
# root

In [6]:
# print(root.tag,root.attrib)

In [7]:
# child = root[1]
# for c in child:
#    print(c.tag,c.attrib)

In [8]:
# child.keys()

In [9]:
# child.get("updated")

In [10]:
# print(type(child))

In [11]:
# for i in child.iter():
#    print(i.tag, i.attrib, i.text)

In [12]:
"""
drugdic = {}
for child in root:
    tempname = child.findtext('{http://www.drugbank.ca}drugbank-id')
    drugdic[tempname] = []
    for grandson in child:
        for deepson in grandson:
            if deepson.findtext('{http://www.drugbank.ca}drugbank-id') is not None:
                tempintname = deepson.findtext('{http://www.drugbank.ca}drugbank-id')
                drugdic[tempname].append(tempintname)
"""

"\ndrugdic = {}\nfor child in root:\n    tempname = child.findtext('{http://www.drugbank.ca}drugbank-id')\n    drugdic[tempname] = []\n    for grandson in child:\n        for deepson in grandson:\n            if deepson.findtext('{http://www.drugbank.ca}drugbank-id') is not None:\n                tempintname = deepson.findtext('{http://www.drugbank.ca}drugbank-id')\n                drugdic[tempname].append(tempintname)\n"

In [13]:
"""
with open('data.csv', 'a', newline='') as f:
    writer = csv.writer(f)
    for i in drugdic:
        item = drugdic[i]
        x = [i]
        y = x + item
        if item == []:
            continue
        else:
            x = [i]
            y = x + item
            writer.writerow(y)
"""

"\nwith open('data.csv', 'a', newline='') as f:\n    writer = csv.writer(f)\n    for i in drugdic:\n        item = drugdic[i]\n        x = [i]\n        y = x + item\n        if item == []:\n            continue\n        else:\n            x = [i]\n            y = x + item\n            writer.writerow(y)\n"

In [14]:
def list_to_match(li):
    x = li[0]
    ans_li = []
    for i in li[1:]:
        y = [x,i]
        ans_li.append(y)
    return ans_li

In [15]:
"""
ans_li = []
with open('data.csv') as f:
    reader = csv.reader(f)
    for i in reader:
        ans_li += list_to_match(i)
"""

"\nans_li = []\nwith open('data.csv') as f:\n    reader = csv.reader(f)\n    for i in reader:\n        ans_li += list_to_match(i)\n"

In [16]:
from rdkit import Chem

In [17]:
# mols= Chem.SDMolSupplier('structures.sdf')

In [18]:
"""
mol = mols[0]
for key in mol.GetPropNames():
    print(key,mols[0].GetProp(key))
"""

'\nmol = mols[0]\nfor key in mol.GetPropNames():\n    print(key,mols[0].GetProp(key))\n'

In [19]:
# print(mols[106]==None)

In [20]:
"""
compounds_li = []
for i in mols:
    if i == None:
        continue
    else:
        name = i.GetProp("DATABASE_ID")
        smiles = i.GetProp("SMILES")
        x = [name, smiles]
        compounds_li.append(x)
"""

'\ncompounds_li = []\nfor i in mols:\n    if i == None:\n        continue\n    else:\n        name = i.GetProp("DATABASE_ID")\n        smiles = i.GetProp("SMILES")\n        x = [name, smiles]\n        compounds_li.append(x)\n'

In [21]:
# df1 = pd.DataFrame(compounds_li)

In [22]:
# df1.tail()

In [23]:
# df1.to_csv("compounds.csv")

In [12]:
def f1(smiles):
    mol = Chem.MolFromSmiles(smiles)
    bit_morgan = {}
    if mol == None:
        return [0] * 512
    else:
        fp = AllChem.GetMorganFingerprintAsBitVect(mol, radius=2, nBits=512, bitInfo=bit_morgan)
    return list(fp)

In [13]:
df1 = pd.read_csv("compounds.csv")
df1 = df1.drop('Unnamed: 0', axis=1)

In [14]:
df1.rename(columns={"0": 'compound'},inplace=True)
df1.rename(columns={"1": 'smiles'},inplace=True)

In [15]:
df1.tail()

     compound                                             smiles
2463  DB15598  [Fe+3].CC1=C([O-])C(=O)C=CO1.CC1=C([O-])C(=O)C...
2464  DB15617  [Fe+3].OC[C@H](O)[C@@H](O)[C@H](O)[C@H](O)CO[C...
2465  DB15678   [Ca++].[O-]C(=O)CCCCCCCCC=C.[O-]C(=O)CCCCCCCCC=C
2466  DB15679                              CC(=O)O[Al](O)OC(C)=O
2467  DB15685  COC1=NC=C(CN2C3CC2CN(C3)C2=CC=C(C=N2)C2=CC(OCC...

In [16]:
df1["smiles"] = df1["smiles"].map(f1)

In [24]:
df1.tail()

     compound                                             smiles
2463  DB15598  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
2464  DB15617  [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, ...
2465  DB15678  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
2466  DB15679  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, ...
2467  DB15685  [1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...

In [6]:
df = pd.read_csv("data_pare.csv")

In [8]:
df.tail()

               0        1
1048570  DB01241  DB00833
1048571  DB01241  DB00861
1048572  DB01241  DB00903
1048573  DB01241  DB00923
1048574  DB01241  DB00939

In [9]:
df.rename(columns={"0": 'compound_1'},inplace=True)
df.rename(columns={"1": 'compound_2'},inplace=True)

In [23]:
df.tail()

        compound compound_2
1048570  DB01241    DB00833
1048571  DB01241    DB00861
1048572  DB01241    DB00903
1048573  DB01241    DB00923
1048574  DB01241    DB00939

In [18]:
df.rename(columns={"compound_1": 'compound'},inplace=True)
df2 = pd.merge(df, df1,on = "compound")

In [19]:
df2.rename(columns={"compound": 'compound_1'},inplace=True)
df2.rename(columns={"compound_2": 'compound'},inplace=True)
df2.rename(columns={"smiles": 'smiles_1'},inplace=True)

In [20]:
df2.tail()

       compound_1 compound                                           smiles_1
981472    DB01241  DB00833  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, ...
981473    DB01241  DB00861  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, ...
981474    DB01241  DB00903  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, ...
981475    DB01241  DB00923  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, ...
981476    DB01241  DB00939  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, ...

In [21]:
df3 = pd.merge(df2, df1,on = "compound")

In [22]:
df3.tail()

,compound_1,compound,smiles_1,smiles
650632,DB01083,DB14476,"[0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, ...","[0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
650633,DB01101,DB03312,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, ...","[0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
650634,DB01156,DB00431,"[0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
650635,DB01195,DB03754,"[0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
650636,DB01235,DB00134,"[0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, ..."

In [40]:
df3.rename(columns={"compound": 'compound_2'},inplace=True)
df3.rename(columns={"smiles": 'smiles_2'},inplace=True)

In [41]:
df3.tail()

,compound_1,compound_2,smiles_1,smiles_2
650632,DB01083,DB14476,"[0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, ...","[0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
650633,DB01101,DB03312,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, ...","[0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
650634,DB01156,DB00431,"[0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
650635,DB01195,DB03754,"[0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
650636,DB01235,DB00134,"[0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, ..."

In [42]:
approved = df1["compound"].values.tolist()

In [43]:
df4 = df3.drop('smiles_1', axis=1)
df4 = df4.drop('smiles_2', axis=1)
df4.tail()

       compound_1 compound_2
650632    DB01083    DB14476
650633    DB01101    DB03312
650634    DB01156    DB00431
650635    DB01195    DB03754
650636    DB01235    DB00134

In [44]:
def f2(x):
    ans = x[2:]
    return ans

In [45]:
df4["compound_1"] = df4["compound_1"].map(f2)
df4["compound_2"] = df4["compound_2"].map(f2)

In [46]:
df4.tail()

       compound_1 compound_2
650632      01083      14476
650633      01101      03312
650634      01156      00431
650635      01195      03754
650636      01235      00134

In [47]:
df1.head()

  compound                                             smiles
0  DB00006  [0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, ...
1  DB00007  [0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
2  DB00014  [0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
3  DB00027  [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
4  DB00035  [0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, ...

In [48]:
df_compound1 = df4["compound_1"].values.tolist()
df_compound2 = df4["compound_2"].values.tolist()

In [49]:
li_link_pare = []
for i in range(len(df_compound1)):
    a = int(df_compound1[i])
    b = int(df_compound2[i])
    if a <= b:
        c = [str(a).zfill(5),str(b).zfill(5)]
    else:
        c = [str(b).zfill(5),str(a).zfill(5)]
    li_link_pare.append(c)

In [50]:
df1["compound"] = df1["compound"].map(f2)

In [51]:
df1.head()

  compound                                             smiles
0    00006  [0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, ...
1    00007  [0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
2    00014  [0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
3    00027  [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
4    00035  [0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, ...

In [52]:
li_compound = df1["compound"].values.tolist()

In [53]:
import itertools

In [54]:
all_pare =  list(itertools.combinations(li_compound,2))

In [55]:
li_link_pare = [tuple(i) for i in li_link_pare]

In [56]:
len(all_pare)

3044278

In [57]:
from tqdm.notebook import tqdm

In [58]:
result = list(set(all_pare) - set(li_link_pare))

In [68]:
df5 = pd.DataFrame(result)

In [69]:
df5.head()

       0      1
0  00266  13928
1  08987  09534
2  01380  04743
3  00396  01025
4  00527  09116

In [61]:
def f3(x):
    ans = "DB"+ x
    return ans

In [70]:
df5.rename(columns={0: 'compound_1'},inplace=True)
df5.rename(columns={1: 'compound_2'},inplace=True)

In [71]:
df5.head()

  compound_1 compound_2
0      00266      13928
1      08987      09534
2      01380      04743
3      00396      01025
4      00527      09116

In [64]:
df5["compound_1"] = df5["compound_1"].map(f3)
df5["compound_2"] = df5["compound_2"].map(f3)

In [65]:
df5.tail()

        compound_1 compound_2
2582384    DB00775    DB01121
2582385    DB00489    DB11575
2582386    DB09282    DB11073
2582387    DB00196    DB08965
2582388    DB09413    DB09449

In [72]:
df5.rename(columns={"compound_1": 'compound'},inplace=True)
df6 = pd.merge(df5, df1,on = "compound")

In [73]:
df6.tail()

        compound compound_2                                             smiles
2582384    15566      15576  [0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, ...
2582385    15566      15598  [0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, ...
2582386    15678      15685  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
2582387    15678      15679  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
2582388    15679      15685  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, ...

In [74]:
df6.rename(columns={"compound": 'compound_1'},inplace=True)
df6.rename(columns={"compound_2": 'compound'},inplace=True)
df6.rename(columns={"smiles": 'smiles_1'},inplace=True)

In [75]:
df7 = pd.merge(df6, df1,on = "compound")

In [76]:
df7.rename(columns={"compound": 'compound_2'},inplace=True)
df7.rename(columns={"smiles": 'smiles_2'},inplace=True)

In [77]:
df7.head()

,compound_1,compound_2,smiles_1,smiles_2
0,00266,13928,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, ..."
1,08987,13928,"[0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, ...","[0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, ..."
2,01380,13928,"[0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, ...","[0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, ..."
3,00527,13928,"[0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, ...","[0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, ..."
4,00504,13928,"[0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, ...","[0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, ..."

In [78]:
df3.head()

,compound_1,compound_2,smiles_1,smiles_2
0,DB00006,DB06605,"[0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, ...","[1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
1,DB00091,DB06605,"[0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, ...","[1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
2,DB00120,DB06605,"[0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
3,DB00159,DB06605,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."
4,DB00163,DB06605,"[0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ..."

In [80]:
df3 = df3.drop('compound_1', axis=1)
df3 = df3.drop('compound_2', axis=1)
df3["target"] = 1

In [81]:
df7 = df7.drop('compound_1', axis=1)
df7 = df7.drop('compound_2', axis=1)
df7["target"] = 0

In [84]:
df3.to_pickle("link_pare.pkl")

In [85]:
df7.to_pickle("nolink_pare.pkl")